# TilePatternTileFailures Properties

---
The BuiltInFailuresTilePatternTileFailures type exposes the following members.
| Name| Description
---|---|---
| TilePatternTile_InvalidFamily|  Family not appropriate for Divided Surface component.
Top
#### Reference
BuiltInFailuresTilePatternTileFailures Class
Autodesk.Revit.DB Namespace